Repository: microsoft/WSL
Catalog: localization/strings/*/Resources.resw
Source language: en_us
Languages: cs_cz, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hu_hu, it_it, ja_jp, ko_kr, nb_no, nl_nl, pl_pl, pt_br, pt_pt, ru_ru, sv_se, tr_tr, zh_cn, zh_tw

# MessageWslPathUsage
source: Usage: -a Force result to absolute path format. -u Translate from a Windows path to a WSL path (default). -w Translate from a WSL path to a Windows path. -m Translate from a WSL path to a Windows path, with '/' instead of '\\' Example: wslpath 'c:\\users'
cs_cz: Zvyk: -a Vynutí formát absolutní cesty výsledku. -u Převede cestu z Windows na cestu WSL (výchozí). -w Umožňuje přeložit z cesty WSL na cestu Windows. -m Převést z cesty WSL na cestu Windows, kde se místo \\přeloží znak / Příklad: wslpath 'c:\\users'
da_dk: Brug: -a Gennemtving resultatet til absolut stiformat. -u Oversæt fra en Windows-sti til en WSL-sti (standard). -w Oversæt fra en WSL-sti til en Windows-sti (standard). -m Oversæt fra en WSL-sti til en Windows-sti, med "/" i stedet for "\\" Eksempel: wslpath "c:\\brugere"
de_de: Verwendung: -a Ergebnis im Format mit absolutem Pfad erzwingen. -u Windows-Pfad in WSL-Pfad umwandeln (Standard). -w WSL-Pfad in Windows-Pfad umwandeln. -m WSL-Pfad in Windows-Pfad umwandeln, mit "/" anstelle von "\\". Beispiel: wslpath 'c:\\users'
el_gr: Χρήση: -a Εξαναγκασμός του αποτελέσματος σε μορφή απόλυτης διαδρομής. -u Μετάφραση από διαδρομή Windows σε διαδρομή WSL (προεπιλογή). -w Μετάφραση από διαδρομή WSL σε διαδρομή Windows. -m Μετάφραση από διαδρομή WSL σε διαδρομή Windows, με '/' αντί για '\\' Παράδειγμα: wslpath 'c:\\users'
es_es: Uso: -a Forzar el resultado al formato de ruta de acceso absoluta. -u Traducir de una ruta de acceso de Windows a una ruta de acceso WSL (valor predeterminado). -w Traducir de una ruta de acceso de WSL a una ruta de acceso de Windows. -m Traducir de una ruta de acceso WSL a una ruta de acceso de Windows, con '/' en lugar de '\\' Ejemplo: wslpath 'c:\\users'
fi_fi: Käyttö: -a Pakota tulos absoluuttiseen polkumuotoon. -u Käännä Windows-polusta WSL-polkuun (oletus). -w Käännä WSL-polusta Windows-polkuun. -m Käännä WSL-polusta Windows-polkuun käyttäen '/'-merkkiä '\\'-merkin sijaan Esimerkki: wslpath 'c:\\users'
fr_fr: Utilisation : -a Force le résultat au format de chemi n d'accès absolu. -u Traduire d’un chemin d’accès Windows en un chemin d’accès WSL (par défaut). -w Traduire d’un chemin d’accès WSL en chemin d’accès Windows. -m Traduire d’un chemin d’accès WSL vers un chemin d’accès Windows, avec « / » au lieu de « \\ » Exemple : wslpath 'c :\\users'
hu_hu: Használat: -a Az eredmény kényszerítése abszolút elérésiút-formátumra. -u Fordítás Windows-útvonalról WSL-útvonalra (alapértelmezett). -w Fordítás WSL-útvonalról Windows-útvonalra. -m Fordítás WSL-útvonalról Windows-útvonalra '\\' helyett '/' karakterrel Példa: wslpath 'c:\\users'
it_it: Uso: -a Forza il risultato al formato di percorso assoluto. -u Converti da un percorso windows a un percorso WSL (impostazione predefinita). -w Converti da un percorso WSL a un percorso di Windows. -m Traduci da un percorso WSL a un percorso di Windows, con '/' invece di '\\' Esempio: wslpath 'c:\\users'
ja_jp: 使用法： -a 結果を絶対パス形式に強制します。 -u Windows パスから WSL パスに変換します (既定)。 -w WSL パスから Windows パスに変換します。 -m WSL パスから Windows パスに変換します ('\\' ではなく '/' を使用) 例: wslpath 'c:\\users'
ko_kr: 사용법: -a 결과를 절대 경로 형식으로 강제 적용합니다. -u Windows 경로에서 WSL 경로로 변환합니다(기본값). -w WSL 경로에서 Windows 경로로 변환합니다. -m WSL 경로에서 '\\' 대신 '/'를 사용하여 Windows 경로로 변환 예: wslpath 'c:\\users'
nb_no: Bruk: -a Tving resultat til absolutt baneformat. -u Oversett fra en Windows-bane til en WSL-bane (standard). -w Oversett fra en WSL-bane til en Windows-bane. -m Oversett fra en WSL-bane til en Windows-bane, med / stedet for \\ Eksempel: wslpath c:\\users
nl_nl: Gebruik: -a Resultaat forceren naar absolute padindeling. -u Vertalen van een Windows-pad naar een WSL-pad (standaard). -w Vertalen van een WSL-pad naar een Windows-pad. -m Vertalen van een WSL-pad naar een Windows-pad, met '/' in plaats van '\\' Voorbeeld: wslpath 'c:\\users'
pl_pl: Użycie: -a Wymuś wynik do bezwzględnego formatu ścieżki. -u Tłumaczenie ze ścieżki systemu Windows na ścieżkę WSL (domyślna). -w Tłumaczenie ze ścieżki WSL na ścieżkę systemu Windows. -m Tłumaczenie ze ścieżki WSL na ścieżkę systemu Windows ze znakiem „/” zamiast „\\” Przykład: wslpath „c:\\users”
pt_br: Uso: -a Forçar o resultado ao formato de caminho absoluto. -u Traduzir de um caminho do Windows para um caminho WSL (padrão). -w Traduzir de um caminho WSL para um caminho do Windows. -m Traduzir de um caminho WSL para um caminho do Windows, com '/' em vez de '\\' Exemplo: wslpath 'c:\\users'
pt_pt: Utilização: -a Forçar resultado para formato de caminho absoluto. -u Traduzir de um caminho do Windows para um caminho WSL (predefinição). -w Traduzir de um caminho WSL para um caminho do Windows. -m Traduzir de um caminho WSL para um caminho do Windows, com "/" em vez de "\\" Exemplo: wslpath 'c:\\users'
ru_ru: Использование: -a Принудительное форматирование результата в абсолютный путь. -u Преобразование из пути Windows в путь WSL (по умолчанию). -w Преобразование из пути WSL в путь Windows. -m Преобразование из пути WSL в путь Windows с "/" вместо "\\" Пример: wslpath "c:\\users"
sv_se: Användning: -a Tvinga resultatet till absolut sökvägsformat. -u Översätt från en Windows-sökväg till en WSL-sökväg (standard). -w Översätt från en WLS-sökväg till en Windows-sökväg. -m Översätt från en WLS-sökväg till en Windows-sökväg med '/' istället för '\\' Exempel: wslpath 'c:\\users'
tr_tr: Kullanım: -a Sonucu mutlak yol biçimine zorla. -u Windows yolundan WSL yoluna çevirin (varsayılan). -w WSL yolundan Windows yoluna çevirin. -m WSL yolundan '\\' yerine '/' içeren bir Windows yoluna çevirin Örnek: wslpath 'c:\\users'
zh_cn: 用法： -a 强制结果为绝对路径格式。 -u 从 Windows 路径转换为 WSL 路径(默认)。 -w 从 WSL 路径转换为 Windows 路径。 -m 从 WSL 路径转换为 Windows 路径，使用“/”而不是“\\” 示例: wslpath 'c:\\users'
zh_tw: 用法： -a 強制結果使用絕對路徑格式。 -u 將 Windows 路徑轉換成 WSL 路徑 (預設)。 -w 將 WSL 路徑轉換成 Windows 路徑。 -m 在將 WSL 路徑轉換成 Windows 路徑時，使用 '/' 而非 '\\' 範例： wslpath 'c：\\users'

# MessageWslconfigUsage
source: Performs administrative operations on Windows Subsystem for Linux Usage: /l, /list [Option] Lists registered distributions. /all - Optionally list all distributions, including distributions that are currently being installed or uninstalled. /running - List only distributions that are currently running. /s, /setdefault <DistributionName> Sets the distribution as the default. /t, /terminate <DistributionName> Terminates the distribution. /u, /unregister <DistributionName> Unregisters the distribution and deletes the root filesystem.
cs_cz: Provádí operace správy na Subsystém Windows pro Linux Využití: /l, /list [Option] Zobrazí seznam registrovaných distribucí. /all - Vypíše všechny distribuce, včetně distribucí, které se právě instalují nebo odinstalovávají. /running - Vypíše pouze distribuce, které jsou aktuálně spuštěné. /s, /setdefault <DistributionName> Nastaví distribuci jako výchozí. /t, /terminate <DistributionName> Ukončí distribuci. /u, /unregister <DistributionName> Zruší registraci distribuce a odstraní kořenový systém souborů.
da_dk: Udfører administrative handlinger på Windows-undersystem til Linux Brug: /l, /list [Indstilling] Viser registrerede distributioner. /all – Vis valgfrit alle distributioner, herunder distributioner, som installeres eller fjernes i øjeblikket. /running – Vis kun distributioner, der kører i øjeblikket. /s, /setdefault <DistributionName> Angiver distributionen som standard. /t, /terminate <DistributionName> Afslutter distributionen. /u, /unregister <DistributionName> Fjerner distributionen og sletter rodfilsystemet.
de_de: Führt Verwaltungsvorgänge für Windows-Subsystem für Linux aus Verbrauch: /l, /list [Option] Listet registrierte Distributionen auf. /all – Optional alle Distributionen auflisten, einschließlich Distributionen, die zurzeit installiert oder deinstalliert werden. /running – Listet nur Distributionen auf, die derzeit ausgeführt werden. /s, /setdefault <DistributionName> Legt die Distribution als Standard fest. /t, /terminate <DistributionName> Beendet die Distribution. /u, /unregister <DistributionName> Hebt die Registrierung der Distribution auf und löscht das Stammdateisystem.
el_gr: Εκτελεί εργασίες διαχείρισης στο Υποσύστημα Windows για Linux Χρήση: /l, /list [Επιλογή] Παραθέτει τις εγγεγραμμένες διανομές. /all - Προαιρετική παράθεση όλων των διανομών, συμπεριλαμβανομένων αυτών που εγκαθίστανται ή απεγκαθίστανται αυτήν τη στιγμή. /running - Παράθεση μόνο των διανομών που εκτελούνται αυτήν τη στιγμή. /s, /setdefault <ΌνομαΔιανομής> Ορίζει τη διανομή ως προεπιλεγμένη. /t, /terminate <ΌνομαΔιανομής> Τερματίζει τη διανομή. /u, /unregister <ΌνομαΔιανομής> Καταργεί την καταχώρηση της διανομής και διαγράφει το ριζικό σύστημα αρχείων.
es_es: Realiza operaciones administrativas en el Subsistema de Windows para Linux Uso: /l, /list [Option] Lista las distribuciones registradas. /all - Opcionalmente, lista todas las distribuciones, incluidas las distribuciones que se están instalando o desinstalando actualmente. /running - Lista solo las distribuciones que se están ejecutando actualmente. /s, /setdefault <DistributionName> Establece la distribución como predeterminada. /t, /terminate <DistributionName> Finaliza la distribución. /u, /unregister <DistributionName> Anula el registro de la distribución y elimina el sistema de archivos raíz.
fi_fi: Suorittaa hallintatoimintoja Windows-alijärjestelmä Linuxille Käyttö: /l, /list [Vaihtoehto] Luetteloi rekisteröidyt jakelut. /all - Näytä luettelo kaikista jakeluista, mukaan lukien jakelut, joita asennetaan tai joiden asennusta poistetaan parhaillaan. /running - Näytä vain parhaillaan käynnissä olevien jakeluiden luettelo. /s, /setdefault <DistributionName> Määrittää jakelun oletukseksi. /t, /terminate <DistributionName> Lopettaa määritetyn jakelun. /u, /unregister <DistributionName> Poistaa jakelun rekisteröinnin ja päätiedostojärjestelmän.
fr_fr: Effectue des opérations d’administration sur Sous-système Windows pour Linux Utilisation : /l, /list [Option] Répertorie les distributions inscrites. /all – Répertoriez éventuellement toutes les distributions, y compris les distributions qui sont en cours d’installation ou de désinstallation. /running – Répertoriez uniquement les distributions en cours d’exécution. /s, /setdefault <DistributionName> Définit la distribution comme valeur par défaut. /t, /terminate <DistributionName> Met fin à la distribution. /u, /unregister <DistributionName> Annule l'enregistrement de la distribution et supprime le système de fichiers racine.
hu_hu: Felügyeleti műveletek végrehajtása Linuxos Windows-alrendszeren Használat: /l, /list [Option] A regisztrált disztribúciók listázása. /all – Az összes disztribúció listázása, beleértve jelenleg telepítés vagy eltávolítás alatt állókat is. /running – Csak a jelenleg futó disztribúciók listázása. /s, /setdefault <DistributionName> Az adott disztribúció beállítása alapértelmezettként. /t, /terminate <DistributionName> Megszakítja a disztribúciót. /u, /unregister <DistributionName> A disztribúció regisztrációjának megszüntetése és a gyökérszintű fájlrendszer törlése.
it_it: Esegue operazioni amministrative su sottosistema Windows per Linux Utilizzo: /l, /list [Opzione] Elenca le distribuzioni registrate. /all - Elenca facoltativamente tutte le distribuzioni, incluse quelle che sono attualmente in fase di installazione o disinstallazione. /running - Elenca solo le distribuzioni attualmente in esecuzione. /s, /setdefault <DistributionName> Imposta la distribuzione come predefinita. /t, /terminate <DistributionName> Termina la distribuzione. /u, /unregister <DistributionName> Annulla la registrazione della distribuzione ed elimina il file system radice.
ja_jp: Linux 用 Windows サブシステム上で管理操作を実行します 使用法: /l, /list [オプション] 登録済みのディストリビューションを一覧表示します。 /all - オプションで、すべてのディストリビューションを一覧表示します。これには、 現在インストール中またはアンインストール中のものが含まれます。 /running - 現在実行中のディストリビューションのみを一覧表示します。 /s, /setdefault <DistributionName> ディストリビューションを既定として設定します。 /t, /terminate <DistributionName> ディストリビューションを終了します。 /u, /unregister <DistributionName> ディストリビューションの登録を解除し、ルート ファイルシステムを削除します。
ko_kr: Linux용 Windows 하위 시스템 관리 작업을 수행합니다. 사용 현황: /l, /list [Option] 등록된 배포를 나열합니다. /all - 필요에 따라 현재 설치 또는 제거 중인 배포를 포함하여 모든 배포를 나열합니다. /running - 현재 실행 중인 배포만 나열합니다. /s, /setdefault <DistributionName> 배포를 기본값으로 설정합니다. /t, /terminate <DistributionName> 배포를 종료합니다. /u, /unregister <DistributionName> 배포를 등록 취소하고 루트 파일 시스템을 삭제합니다.
nb_no: Utfører administrative operasjoner på Windows-undersystem for Linux Bruk: /l, /list [Alternativ] Lister opp registrerte distribusjoner. /all – Du kan også liste opp alle distribusjoner, inkludert distribusjoner som for øyeblikket installeres eller avinstalleres. /running – Lister bare opp distribusjoner som kjører for øyeblikket. /s, /setdefault <DistributionName> Setter distribusjonen som standard. /t, /terminate <DistributionName> Avslutter distribusjonen. /u, /unregister <DistributionName> Avregistrerer distribusjonen og sletter rotfilsystemet.
nl_nl: Voert beheerbewerkingen uit op Windows-subsysteem voor Linux Gebruik: /l, /list [Optie] Hiermee worden geregistreerde distributies opgenoemd. /all - Optioneel alle distributies vermelden, inclusief distributies die worden momenteel geïnstalleerd of verwijderd. /running - Alleen distributies weergeven die momenteel worden uitgevoerd. /s, /setdefault <DistributionName> Hiermee stelt u de distributie als standaard in. /t, /terminate <DistributionName> Hiermee wordt de distributie beëindigd. /u, /unregister <DistributionName> Hiermee maakt u de registratie van de distributie ongedaan en wordt het hoofdbestandssysteem verwijderd.
pl_pl: Wykonuje operacje administracyjne w podsystemie Windows dla systemu Linux Użycie: /l, /list [Option] Wyświetla listę zarejestrowanych dystrybucji. /all — Opcjonalnie wyświetla wszystkie dystrybucje, w tym dystrybucje, które są aktualnie instalowane lub odinstalowywane. /running — Wyświetla tylko dystrybucje, które są obecnie uruchomione. /s, /setdefault <DistributionName> Ustawia dystrybucję jako domyślną. /t, /terminate <DistributionName> Kończy działanie określonej dystrybucji. /u, /unregister <DistributionName> Wyrejestrowuje dystrybucję i usuwa system plików katalogu głównego.
pt_br: Executa operações administrativas em Subsistema do Windows para Linux Uso: /l, /list [Option] Lista as distribuições registradas. /all - Lista todas as distribuições, incluindo distribuições que estão sendo instaladas ou desinstaladas no momento. /running - Lista apenas distribuições que estão em execução no momento. /s, /setdefault <DistributionName> Define a distribuição como o padrão. /t, /terminate <DistributionName> Encerra a distribuição especificada. /u, /unregister <DistributionName> Cancela o registro da distribuição e exclui o sistema de arquivos raiz.
pt_pt: Executa operações administrativas no Subsistema Windows para Linux Utilização: /l, /list [Option] Lista as distribuições registadas. /all - Opcionalmente lista todas as distribuições, incluindo distribuições que estão atualmente a ser instaladas ou desinstaladas. /running - Lista apenas as distribuições que estão atualmente em execução. /s, /setdefault <DistributionName> Define a distribuição como predefinição. /t, /terminate <DistributionName> Termina a distribuição especificada. /u, /unregister <DistributionName> Anula o registo da distribuição e elimina o sistema de ficheiros raiz.
ru_ru: Выполняет административные операции в подсистеме Windows для Linux Использование: /l, /list [Параметр] Перечисляет зарегистрированные дистрибутивы. /all - необязательно перечислить все дистрибутивы, включая дистрибутивы, которые устанавливаются или удаляются в настоящий момент. /running — перечислить только дистрибутивы, которые сейчас запущены. /s, /setdefault <DistributionName> Задает дистрибутив по умолчанию. /t, /terminate <DistributionName> Прерывает работу дистрибутива. /u, /unregister <DistributionName> Отменяет регистрацию дистрибутива и удаляет корневую файловую систему.
sv_se: Utför administrativa åtgärder på Windows-undersystem för Linux Användning: /l, /list [Option] Listar registrerade distributioner. /all - Lista valfritt alla distributioner, inklusive distributioner som håller på att installeras eller avinstalleras. /running - Listar endast distributioner som körs för närvarande. /s, /setdefault <DistributionName> Anger fördelningen som standard. /t, /terminate <DistributionName> Avslutar distributionen. /u, /unregister <DistributionName> Avregistrerar distributionen och tar bort rotfilsystemet.
tr_tr: Linux için Windows Alt Sisteminde yönetimsel işlemler gerçekleştirir Kullanım: /l, /list [Seçenek] Kayıtlı dağıtımları listeler. /all - Şu anda yüklenmekte veya kaldırılmakta olan dağıtımlar da dahil olmak üzere tüm dağıtımları listeler. /running - Yalnızca şu anda çalışmakta olan dağıtımları listeler. /s, /setdefault <DistributionName> Dağıtımı varsayılan olarak ayarlar. /t, /terminate <DistributionName> Dağıtımı sonlandırır. /u, /unregister <DistributionName> Dağıtımın kaydını siler ve kök dosya sistemini siler.
zh_cn: 对适用于 Linux 的 Windows 子系统执行管理操作 用法: /l, /list [选项] 列出已注册的分发版。 /all - (可选)列出所有分发版，包括 当前安装或未安装的分发版。 /running - 仅列出当前正在运行的分发版。 /s, /setdefault <DistributionName> 将分发版设置为默认值。 /t, /terminate <DistributionName> 终止分发版。 /u, /unregister <DistributionName> 取消注册分发版并删除根文件系统。
zh_tw: 在 Windows 子系統 Linux 版上執行系統管理作業 使用情況: /l, /list [Option] 列出已註冊的發行版本。 /all - 選擇性地列出所有發行版本，包括 目前正在安裝或卸載的發行版本。 /running - 只列出目前正在執行的發行版本。 /s, /setdefault <DistributionName> 將發行版本設定為預設值。 /t, /terminate <DistributionName> 終止發行版本。 /u, /unregister <DistributionName> 取消註冊發行版本並刪除根檔案系統。
